CSI API ETABS v1

# cSapModelStory Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cStory Story { get; }

    ReadOnly Property Story As cStory
    	Get

    Dim instance As cSapModel
    Dim value As cStory

    value = instance.Story

    property cStory^ Story {
    	cStory^ get ();
    }

    abstract Story : cStory with get

#### Property Value

Type: cStory

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com